app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("updated_at", "title", "body", "created_at") VALUES('2009-05-17 21:39:01', 'title 1', 'body 1', '2009-05-17 21:39:01')

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "title" = 'title 1', "body" = 'body 1', "updated_at" = '2009-05-17 21:53:57' WHERE "id" = 1